// підключення заголовкового файлу для
#include <iostream> // потоків вводу/виводу

int max(int a, int b){ // створення функції з двома цілочисельними параметрами
  return a > b ? a : b; // повернення результату умовного тернарного оператора
}

int max(int a, int b, int c){ // перевантаження функції max з трьома цілочисельними параметрами
  return max(a,b) > c ? max(a,b) : c;  // повернення результату умовного тернарного оператора
}

int max(int a, int b, int c, int d){ // перевантаження функції max з чотирма цілочисельними параметрами
  return max(a,b,c) > d ? max(a,b,c) : d; // повернення результату умовного тернарного оператора
}

float max(float a, float b){ // перевантаження функції max з двома дійсними параметрами
  return a > b ? a : b; // повернення результату умовного тернарного оператора
}

float max(float a, float b, float c){ // перевантаження функції max з трьома дійсними параметрами
  return max(a,b) > c ? max(a,b) : c; // повернення результату умовного тернарного оператора
}

float max(float a, float b, float c, float d){ // перевантаження функції max з чотирма дійсними параметрами
  return max(a,b,c) > d ? max(a,b,c) : d; // повернення результату умовного тернарного оператора
}

int main(){
  int a = 5, b = 9, c = 4, d = 1; // ініціалізація змінних з цілими числами
  float af = 3.5, bf = 9.9, cf = 11.3, df = 6.0; // ініціалізація змінних з дійсними числами
  
  std::cout << "Max of " << a << " and " // виведення тексту, змінних і повернене значення функції max
    << b << " is " << max(a,b) << std::endl;
  std::cout << "Max of " << a << ", " << b  // виведення тексту, змінних і повернене значення функції max
    << " and " << c << " is " << max(a,b,c) << std::endl;
  std::cout << "Max of " << a << ", " << b  // виведення тексту, змінних і повернене значення функції max
    << ", " << c << " and " << d << " is " << max(a,b,c) << std::endl;

  std::cout << "Max of " << af << " and "  // виведення тексту, змінних і повернене значення функції max
    << bf << " is " << max(af,bf) << std::endl;
  std::cout << "Max of " << af << ", " << bf  // виведення тексту, змінних і повернене значення функції max
    << " and " << cf << " is " << max(af,bf,cf) << std::endl;
  std::cout << "Max of " << af << ", " << bf  // виведення тексту, змінних і повернене значення функції max
    << ", " << cf << " and " << df << " is " << max(af,bf,cf) << std::endl;
}
