import math

#  Обчислення гіперболічного синуса через степеневий ряд
def shX(x):
    eps = 1e-4  # константа точності

    # ініціалізація змінних
    sum = 0.0   # накопичення суми ряду
    n = 0        # індекс члена ряду

    # цикл з обчисленнями
    while True:
        k = 2 * n + 1  # індекс факторіалу (2n + 1)

        # обчислення факторіала у циклі
        fact = 1.0
        for i in range(1, k + 1):
            fact *= i

        # член ряду
        term = x**k / fact

        # перевірка умов для зупинки
        if abs(term) < eps:
            break

        # сумування
        sum += term
        n += 1  # збільшення n

    return sum  # повернення результату


# ініціалізація констант
A = 0.87 * 1e5
B = 1.8056

# форматований заголовок
print("  X\t\tsh(X)\t\tY\t\t\tZ")

# цикл зі зміною аргументу
X = 0.0
while X <= 1.57 + 1e-6:
    shx = shX(X)  # обчислення гіперболічного синуса через ряд

    # Обчислення значень з перевіркою ділення на 0
    if X == 0:
        Y = float('inf')
    else:
        Y = A / X - B * shx
    if Y == 0:
        Z = float('inf')
    else:
        Z = A / Y - B * shx
    # Форматований вивід (повністю як у C++)
    print(f"| {X:.2f}\t|\t{shx:.2f}\t|\t{Y:.2f}\t|\t{Z:.2f}")

    X += 0.1  # крок
