// Підключення заголовкових файлів для:
#include <iostream> // - функцій потоків вводу/виводу
#include <cmath>    // - математичних функцій
#include <iomanip>  // - керування потоками введення/виведення

using namespace std; // Використання простору імен std

float shX(float x) { // обчислення гіперболічного синуса через степеневий ряд
  const float eps = 1e-4f; // ініціалізація константи
  // ініціалізація змінних
  float sum = 0.0f; // змінна для накопичення суми
  int n = 0; // індекс члена ряду
  
  // цикл з обчисленнями
  while (true) {
    int k = 2 * n + 1; // індекс факторіалу

    // обчислення факторіала у циклі
    float fact = 1.0f;
    for (int i = 1; i <= k; i++)
      fact *= i;

    float term = powf(x, k) / fact; // член ряду

    if (fabsf(term) < eps) // перевірка умов для зупинки підпрограми
      break;

    sum += term; // сумування
    n++; // збільшення члена ряду на 1
  }

  return sum; // повернення результату підпрограми
}

int main() {
  // ініціалізація констант для скорочення запису обчислень
  const float A = 0.87f * 1e5f;
  const float B = 1.8056f;

  // форматоване виведення
  cout << fixed << setprecision(2);
  cout << "  X\t\tsh(X)\t\tY\t\t\tZ\n";

  // цикл зі зміною аргументу
  for (float X = 0.0f; X <= 1.57f; X += 0.1f) {
    float shx = shX(X); // обчислення гіперболічного синусу через ряд

    // Обчислення
    float Y = A / X - B * shx;
    float Z = A / Y - B * shx;

    // Форматований вивід
    cout << "| " << X
         << "\t|\t" << shx
         << "\t|\t" << Y
         << "\t|\t" << Z << "\n";
  }
  return 0; // повернення успішного виконання програми
}
