#include <cmath>    // Підключення заголовкового файлу 
                    // з математичними функціями ( для sqrt() ).
#include <iomanip>  // Підключення заголовкового файлу для функцій
                    // керування потоками введення/виведення даних
                    // ( для fixed, setprecision() ).
                    
#include <iostream> // Підключення заголовкового файлу для функцій
                    // базового потоку введення/виведення  даних
                    // ( для cout ).

int main(){           // Головна функція main() цілочисельного типу
  const int size = 8; //Ініціалізація константи size цілочисельного
                      // типу int зі значенням 8.
  float vectorX[size],  // Оголошення масиву для зберігання даних з
                        // плаваючою крапкою, на 8 елементів.
        dobutok = 0.0f, // Ініціалізація змінної з значенням 0.0.
        vectorY[size] = {3.4, 3.1, 6.6, 7.2, 2.9, 1.5, 4.2, 5.8};
                        // Ініціалізація масиву для даних з 
                        // плаваючою крапкою.
  for(int i = 0; i < size; i++)// Цикл з лічильником для заповнення
  {                            // масиву розрахунковими даними.
    vectorX[i] = 2*sqrt(i+2);  // Розрахунок елементів масиву де
                    // 2 множиться на квадратний корінь з i+2.
                    // і+2 тому, що +1  для вирівнення індексу
                    // та +1 по формулі
    dobutok += vectorX[i] * vectorY[i]; // Отримання верторного
  }        // добутку шляхом додавання добутку елементів масивів
          // до змінної для зберігання добутку

  std::cout       // Виклик функції для виведення даних в консоль.
    << std::fixed // Застосування формату щодо відображення даних
                  // з плаваючою крапкою.
    << std::setprecision(2) // Задає кількість цифр після крапки.
    <<"Dobutok: " // Текст для видедення.
    << dobutok    // Виведення змісту змінної
    << std::endl; // Сигнал про завершення рядку
  return 0;  // Повернення даних виконання з функції main()
}
