                   // підключення заголовкових файлів:
#include <iostream>// для функцій вводу/виводу
#include <cmath>   // для функції atan2
#include <iomanip> // для setprecision, fixed

float angle(float x, float y) { // функція angle з параментрами x,y типу float
  return std::atan2(y,x) * 180.0 / M_PI; // повернення значень обчислення
}

int main() { // початок функції main
  float x[4] = {4.6, 9.3, 12.3, 6.3}, // ініціалізація масивів  x,y
        y[4] = {9.4, 9.5, 7.1, 8.3},
        angles[4], // оголошення масиву angles
        maxAngle = 0; // ініціалізація змінної maxAngle

  // цикл для пошуку кутів
  for (int i = 0; i < 4; i++) { // Початок циклу з лічильником
    angles[i] = angle(x[i], y[i]); // виклик функції angle і запис результату
                                   // повернення даних в елемент і масиву angles 
    if (angles[i] > maxAngle) // знаходження максимального кута
        maxAngle = angles[i]; // запис максимального кута в змінну maxAngle
  } // кінець циклу з лічильником

  std::cout << "Виведення точок і їх кутів: \n";

  // цикл для виведення координат точок і їх кутів
  for (int i = 0; i < 4; i++) // цикл з лічильником
    std::cout << std::fixed << std::setprecision(2) // формат виведення дробових чисел
      << "| x: " << x[i] // виведення елементу і масиву х, \t - табуляція
      << "\ty: " << y[i] // виведення елементу і масиву y
      << "\t\tКут = " << angles[i]  // виведення елементу і масиву angles
      << std::endl; // кінець рядка

  std::cout << "Максимальний кут: " << maxAngle << std::endl; // виведення значення maxAngle

  // цикл для пошуку точок найбільшого кута
  for (int i = 0; i < 4; i++) // цикл з лічильником
    if (angles[i] == maxAngle) // пошук maxAngle в масиві
        std::cout << "Координати точки з цим кутом: \n" 
          << "| x: " << x[i]  // виведення елементу і масиву х
          << "\ty: " << y[i]  // виведення елементу і масиву y
          << std::endl; // кінець рядка

  return 0; // повернення коду уснішного виконання програми
} // кінець функції main
