// Підключення заголовкових файлів для:
#include <iostream> // - функцій потоків вводу/виводу
#include <cmath>    // - математичних функцій
#include <iomanip>  // - керування потоками введення/виведення

using namespace std; // Використання простору імен std

struct Coords{ // реалізація глобальної структури
  int x,y,z; // оголошення змінних
} point[5]; // оголошення масиву даної структури на 5 елементів

int coordLength(Coords point) { // реалізація функції яка повертає
                                // цілочисельне значення, параметром є структура
  return sqrt(point.x * point.x + // повернення цілочисельного значення
      point.y * point.y + // обчислення довжини вектора 
      point.z * point.z);
}

void BubbleSort(int size) { // реалізація сортування бульбашкою
  for (int i = 0; i < size - 1; i++) { // проходи сортування
    for (int j = 0; j < size - i - 1; j++) { // ітерації сортування
      if (coordLength(point[j]) // порівняння повернених значень функції
          > coordLength(point[j+1])) // відносно двох елементів масиву структур
        swap(point[j], point[j + 1]); // swap() міняє місцями елементи в пам`яті
    }
  }
}

int main(){ // головна функція
  for(int i = 0; i < 5; i++) { // цикл з лічильником для ітерацій отримання вводу
    cout << "Enter some coordinates(x y z): "; // виведення текстового рядка
    cin >> point[i].x // отримання вводу з клавіатури і почерговий запис в
      >> point[i].y   // відповідні змінні елементів масиву структур
      >> point[i].z; 
  }
  
  BubbleSort(5); // виклик функції для сортування бульбашкою з аргументом 5
  for(int i = 0; i < 5; i++) { // цикл для друку елементів масиву
    if(i == 0) { // перевірка чи це перша ітерація
      cout << "Our coordinates:\n" // виведення тексту
      << setw(3) << "X" << setw(3) << '|' // setw() - мінімальний відступ зліва
      << setw(3) << "Y" << setw(3) << '|' 
      << setw(3) << "Z" << setw(3) << '|' << endl; // endl переходить на новий рядок

      for(int i = 1; i <= 6*3; i++) { // цикл для виведення декору таблиці
                                      // 6 - ширина стовпця, а 3 їх кількість
        // перевірка на виведення відповідного символу
        if(i%6 == 0) cout << '|';
        else cout << '-';
      }
      cout << endl; // перехід на новий рядок
    }

    cout << setw(5) << point[i].x << '|' // мінімальний відступ зліва і
      << setw(5) << point[i].y << '|' // виведення змінних елементів масиву стриктур
      << setw(5) << point[i].z << '|' << endl;
  }
  // пошук точок з однаковою координатою X
  for(int i = 0; i < 5; i++){ // перебір елемента до якого порівнюється
    for(int j = i + 1; j < 5; j++){ // перебір елементів наступних від порівнюваного
      if(point[i].x == point[j].x) // перевірка чи значення змінних елементів масиву структур рівні
        cout << "Points that have the same X coordinate:\n" // вивід тексту і цих елементів
          << point[i].x << ' ' << point[i].y << ' ' << point[i].z << endl
          << point[j].x << ' ' << point[j].y << ' ' << point[j].z << endl;
    }
  }
  return 0; // синхронізація з препроцесором
}

