from math import exp # підключення функхії exp з бібліотеки math
from numpy import linspace # підключення функції linspace з
#бібліотеки numpy(для операцій над масивами чисел)
m = [-1.85, 2.39, 3.65] # Ініціалізація списку з 3 елементів
for q in linspace(2.8, 5.4, num=3): # цикл з зміною арґументу.
# i початковим значенням 2.8, кінцевим 5.4, на 3 кроки.
# linspace на відміну від range підтримує тип float
# linspace строго слідує кількості кроків
    print(f"q = {q:.2f}") # виведення форматованого рядка
    for i in range(3): # цикл з лічильником
        z = m[i] + (exp(m[i]/m[i])-q)/(1-m[i]) # обчислення
        print(f"z = {z:.2f}\tm[{i}] = {m[i]:.2f}") # виведення форматованого
							 	                   #рядка

