                    // Підключення заголовкових файлів для:
#include <iostream> // - функцій потоків вводу/виводу
#include <math.h>   // - математичних функцій
#include <iomanip>  // - керування потоками введення/виведення

int main(){ // початок головної функції
  float m[3] = {-1.85, 2.39, 3.65}; // ініціалізація масиву m з 3 елементів
  float z, q; // оголошення змінних

  for(q = 2.8; q <= 5.4; q += 1.3){ // початок циклу з  зміною аргументу q
    std::cout << std::fixed << std::setprecision(2) // виведення даних
      << "q = " << q << std::endl;			            // в консоль
    for(int i = 0; i < 3; i++){ // початок циклу з лічильником
      z = m[i] + (exp(m[i]/m[i])-q)/(1-m[i]); // обчислення за формулою
      std::cout << std::fixed << std::setprecision(2) // виведення даних
        << "z = " 							                      // в консоль
        << z << "\tm[" << i << "] = "
        << m[i]
        << std::endl;
    } // кінець циклу з лічильником
  } // кінець циклу з зміною аргументу
  return 0; // повернення виконання функції
} // кінець головної функції

