even = 0  # ініціалізація змінної з кількістю парних елементів
rows = 3  # ініціалізація змінної з кількістю радків
col = 4   # ініціалізація змінної з кількістю стовпців

A = [             # ініціалізація масиву на rows радків і col стовпців
    [2, 6, 1, 9],
    [3, 3, 7, 4],
    [5, 7, 6, 2]
    ]

for m in range(rows): # цикл з лічильником для перебору рядків
    for n in range(col): # цикл з лічильником для перебору елементів рядків
        print(f" | {A[m][n]}", end="") # виведення елементів рядків
    print() # кінець циклу для перебору елементів рядків

for m in range(rows): # цикл з лічильником для перебору рядків
    for n in range(col): # цикл з лічильником для перебору елементів рядків
        if A[m][n] % 2 == 0: # перевірка елементу масиву на парність
            even += 1 # інкремент змінної з кількістю парних чисел
            if even == 3 or even == 5: # перевірка чи елемент A[m][n] 3-ий або 5-ий
                print(f"\n | {even}-ий парний елемент матриці A знаходиться в:") # виведення результатів
                print(f" | {m+1}-ому рядкові і {n+1}-ому стовпцеві")
