#include <iostream>// підключення заголовкового файлу для функцій потоків вводу/виводу

int main(){
  int even = 0;  // ініціалізація змінної для збереження кількості парних елементів
  int rows = 3, // ініціалізація змінної з кількістю радків
      col = 4; // ініціалізація змінної з кількістю стовпців
  int A[rows][col] = { // ініціалізація двовимірного масиву по розмірності
    {2,6,1,9},         
    {3,3,7,4},
    {5,7,6,2}
  };
  
  // блок для друку матриці в консолі
  for(int m = 0; m < rows; m++){ // цикл з лічильником для перебору рядків
    for(int n = 0; n < col; n++){ // цикл з лічильником для перебору елементів рядків
      std::cout << " | " << A[m][n]; // виведення елементів рядків
    } // кінець циклу для перебору елементів рядків
  }   // кінець циклу для перебору рядків
  
  // блок для знаходження 3-ого та 5-ого парних елементів
  for(int m = 0; m < rows; m++){ // цикл з лічильником для перебору рядків
    for(int n = 0; n < col; n++) // цикл з лічильником для перебору елементів рядків{
      if(A[m][n]%2 == 0){ // перевірка елементу масиву на парність
        even++;  // інкремент змінної з кількістю парних чисел
        if(even == 3 or even == 5) // перевірка чи елемент A[m][n] 3-ий або 5-ий
          std::cout << "\n | " // виведення результатів
            << even << "-ий парний елемент матриці A знаходиться в: \n | " 
            << m+1 << "-ому рядкові і " << n+1 << "-ому стовпцеві" << std::endl;
      }
    } // кінець циклу для перебору елементів рядків
  }   // кінець циклу для перебору рядків

  return 0;
}
